{
  "tools": [
    {
      "name": "generate_usn_declaration",
      "description": "Генерирует декларацию по УСН в формате XML по стандартам ФНС. Поддерживает УСН «Доходы» (6%) и УСН «Доходы минус расходы» (15%). Возвращает XML (КНД 1152017, версия 5.05) + человекочитаемый отчёт + сумму налога к уплате. Локальная генерация без вызова внешних API."
    },
    {
      "name": "generate_osno_declaration",
      "description": "Генерирует декларацию по ОСНО в формате XML по стандартам ФНС. Возвращает XML (КНД 1151001, версия 5.10) + человекочитаемый отчёт + сумму налога к уплате. Локальная генерация без вызова внешних API."
    },
    {
      "name": "generate_nds_declaration",
      "description": "Генерирует декларацию по НДС в формате XML по стандартам ФНС. Возвращает XML (КНД 1151001, версия 5.10) + человекочитаемый отчёт + суммы НДС к уплате/возмещению. Локальная генерация без вызова внешних API."
    },
    {
      "name": "generate_6ndfl_declaration",
      "description": "Генерирует форму 6-НДФЛ в формате XML по стандартам ФНС. Возвращает XML (КНД 1151078, версия 5.10) + человекочитаемый отчёт + суммы НДФЛ. Локальная генерация без вызова внешних API."
    },
    {
      "name": "search_companies",
      "description": "Поиск компаний, ИП и физических лиц в ЕГРЮЛ/ЕГРИП. Поддерживает поиск по ИНН, ОГРН, ФИО, названию организации, адресу, контактам. Возвращает список найденных организаций с основными реквизитами."
    },
    {
      "name": "autocomplete",
      "description": "Автодополнение для поиска компаний и ИП. Поддерживает поиск по первым буквам названия (более 2-х букв), полным названиям, ФИО ИП, цифрам ИНН (более 5-ти цифр). Возвращает до 100 значений."
    },
    {
      "name": "get_company_data",
      "description": "Получение всех актуальных и исторических данных о компании из ЕГРЮЛ/ЕГРИП. Включает информацию об учредителях, руководителях, видах деятельности, адресах, лицензиях и истории изменений."
    },
    {
      "name": "multinfo_companies",
      "description": "Получение базовых данных сразу о нескольких компаниях (до 100). На входе подается массив ОГРН или ИНН компаний, разделенных запятыми. Возвращает актуальные данные из ЕГРЮЛ/ЕГРИП."
    },
    {
      "name": "multcheck_companies",
      "description": "Базовая проверка группы компаний (до 100). Позволяет провести упрощенную проверку нескольких юридических лиц или индивидуальных предпринимателей одновременно."
    },
    {
      "name": "check_counterparty",
      "description": "Проверка контрагента на признаки недобросовестности. Позволяет получать информацию о том, попало ли юридическое лицо в различные негативные реестры ФНС, отметки о недостоверных данных, признаки «массового» директора, учредителя и прочие."
    },
    {
      "name": "check_account_blocks",
      "description": "Проверка блокировок счета компании. Запрос полной информации о действующих решениях ФНС о приостановлении операций по счетам в формате JSON."
    },
    {
      "name": "check_account_blocks_file",
      "description": "Проверка блокировок счета в виде файла. Вывод полной информации о действующих решениях ФНС о приостановлении операций по счетам в виде файла ZIP с подписью ФНС."
    },
    {
      "name": "track_changes",
      "description": "Отслеживание изменений параметров компании в ЕГРЮЛ/ЕГРИП. Позволяет получить те параметры компании, которые изменились, начиная с указанной даты."
    },
    {
      "name": "monitor_companies",
      "description": "Мониторинг изменений по списку компаний. Формирование списка компаний для мониторинга и отслеживание изменений в ЕГРЮЛ/ЕГРИП по этому списку. Поддерживает команды: list, add, del, chd, chbo."
    },
    {
      "name": "get_extract",
      "description": "Получение официальной выписки ФНС из ЕГРЮЛ или ЕГРИП. Возвращает выписку в формате PDF, заверенную подписью ФНС."
    },
    {
      "name": "get_msp_extract",
      "description": "Получение выписки из реестра МСП. Возвращает выписку о компании из единого реестра малых и средних предприятий в формате PDF."
    },
    {
      "name": "get_accounting_report",
      "description": "Получение бухгалтерской отчетности организации (только юридические лица). Отчетность приведена начиная с 2019 года. Доступна по формам 1 (Баланс), 2 (Отчет о прибылях и убытках), 3, 4."
    },
    {
      "name": "get_accounting_report_file",
      "description": "Получение бухгалтерской отчетности в виде файла. Бухгалтерская отчетность организации в виде файла ZIP или PDF, заверенного подписью ФНС."
    },
    {
      "name": "get_inn_by_passport",
      "description": "Узнать ИНН физического лица по паспортным данным. Возвращает ИНН физического лица на основании введенных паспортных данных (ФИО, дата рождения, серия и номер паспорта)."
    },
    {
      "name": "check_passport",
      "description": "Проверка паспорта на недействительность. Проверяет серию и номер паспорта по списку недействительных российских паспортов."
    },
    {
      "name": "check_passport_info",
      "description": "Информация о паспорте с причиной недействительности. Проверяет серию и номер паспорта и возвращает информацию о причине недействительности, если паспорт признан недействительным."
    },
    {
      "name": "check_person_status",
      "description": "Проверка статусов физического лица. Проверяет статус самозанятого, является ли физическое лицо индивидуальным предпринимателем, банкротство физического лица, недействительность ИНН."
    },
    {
      "name": "get_fsrar_licenses",
      "description": "Получение лицензий ФСРАР для компании. Возвращает информацию о лицензиях по данным ФСРАР (Федеральная служба по регулированию алкогольного рынка)."
    },
    {
      "name": "get_api_statistics",
      "description": "Получение статистики использования API ключа. Возвращает информацию статистику о количестве использованных и доступных запросов по каждому из методов API-ФНС."
    }
  ]
}
